import { useParams } from 'react-router-dom';
import photo from '../assets/bootcamps.png';
import '../styles/bootCampName.css'

function BootCampName() {
    const { name } = useParams()
    const bootCamps = [
        {
            name: 'react',
            info: 'تقریباً همه شما می‌دانید که یادگیری زبان HTML، CSS و جاوا اسکریپت برای ساخت صفحات وب لازم است اما ممکن است در آگهی‌های استخدام به جز این سه زبان، اسم دیگری به نام ReactJS را دیده باشید و احتمالاً این سؤال برایتان مطرح شده که آیا ReactJS یک زبان برنامه نویسی جدید و یا نرم افزار برنامه نویسی است؟! در این مطلب به شما خواهیم گفت که reactJS دقیقاً چیست و سپس به فواید استفاده از آن در برنامه نویسی اشاره خواهیم کرد.'
        },
        {
            name: 'android',
            info: 'اگرچه امروزه زبان جاوا به ‌عنوان اصلی‌ترین زبان برای ساخت اکثر برنامه‌های اندروید استفاده می‌شه، اما می‌توان از زبان‌های دیگر هم برای ساخت و توسعۀ برنامه‌های اندرویدی استفاده کرد. تفاوت بین زبان‌های برنامه‌نویسی اندروید می‌تونه کمی پیچیده و جزئی باشه. انتخاب اینکه کدام زبان رو برای شروع باید انتخاب کرد نیازمند درک نقاط قوت و ضعف آن زبان است.'
        },
        {
            name: 'python',
            info: 'پایتون (python) یکی از زبان برنامه نویسی شی گرا است که در سال ۱۹۹۱ منتشر شده است. تنوع پایتون، سازگاری، یادگیری اصول اولیه آسان‌تر آن را از دیگر زبان‌های برنامه‌نویسی جدا کرده است. از آنجا که شرکت بزرگ گوگل، این زبان را به یکی از زبان‌های برنامه‌نویسی رسمی خود تبدیل کرده‌اند، موجب شده تا این زبان در سراسر جهان از اهمیت ویژه ای برخوردار باشد و روند رو به رشدی را در سال‌های اخیر طی کند. برنامه‌نویسی این زبان از نظر محبوبیت هم‌اکنون در رتبۀ دوم جای دارد که نشان از پیشرفت روز افزون این زبان در بین جامعۀ برنامه‌نویسان است. همچنین کتابخانه‌های وسیع و جامعۀ فعال این زبان باعث شده تا پایتون به عنوان دومین زبان برنامه نویسی مورد علاقه هکرها تبدیل شود.'
        },
        {
            name: 'java',
            info: '(java) یک زبان برنامه نویسی شی‌ءگرای محبوب است که در سال 1995 توسط جیمز آرتور گاسلینگ منتشر شده است. این زبان در ابتدا برای دستگاه‌های ستاپ باکس طراحی شده بود اما امروزه برای ایجاد برنامه‌های وب و موبایل استفاده می‌شود. در حال حاضر جاوا متعلق به شرکت اوراکل است و بیش از 3 میلیارد دستگاه بر پایه این زبان اجرا می‌شود. همچنین این زبان مستقل از پلتفرم است یعنی بر هر نوع سیستم‌عامل و سخت‌افزار قابل‌اجرا است. کدهای این زبان توسط ماشین مجازی JVM به زبان ماشین تبدیل شده و اجرا می‌شوند.'
        }
    ]
    return (


        <div className='container'>
            <img src={photo} className='mainPhoto' />

            <div className='info'>
                {
                    bootCamps.map((el) => {
                        return (
                            name == el.name ?
                                <div>
                                    <div className='bootCampName'> {el.name}</div>
                                    <div className='bootCampsInfo'>{el.info}</div>
                                </div>
                                : ''
                        )


                    })
                }
            </div>
        </div>
    );
}

export default BootCampName;